# Install PandasQL

In [2]:
!pip install pandasql

Requirement already satisfied: pandasql in /usr/local/lib/python3.7/site-packages (0.7.3)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/site-packages (from pandasql) (1.18.1)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/site-packages (from pandasql) (1.3.12)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/site-packages (from pandasql) (0.25.1)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.7/site-packages (from pandas->pandasql) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/site-packages (from pandas->pandasql) (2019.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.13.0)

# Examples

In [4]:
import pandas as pd
from pandasql import sqldf

In [6]:
golden_globe_awards = pd.read_csv('golden_globe_awards.csv')

In [7]:
sqldf('SELECT * FROM golden_globe_awards LIMIT 10')

   year_film  year_award  ...                     film win
0       1943        1944  ...  For Whom The Bell Tolls   1
1       1943        1944  ...  For Whom The Bell Tolls   1
2       1943        1944  ...   The Song Of Bernadette   1
3       1943        1944  ...                     None   1
4       1943        1944  ...   The Song Of Bernadette   1
5       1943        1944  ...       Watch On The Rhine   1
6       1944        1945  ...          Mrs. Parkington   1
7       1944        1945  ...             Going My Way   1
8       1944        1945  ...             Going My Way   1
9       1944        1945  ...                     None   1

[10 rows x 7 columns]

In [9]:
sqldf('SELECT count(DISTINCT year_award) as total_years_of_ceremony FROM golden_globe_awards')

   total_years_of_ceremony
0                       77

In [17]:
sqldf('''
SELECT film, count(*) as no_of_prizes 
FROM golden_globe_awards
WHERE film IS NOT NULL AND win IS TRUE
GROUP BY film
ORDER BY 2 DESC
LIMIT 10
''')

                              film  no_of_prizes
0                M*A*S*H (TV Show)             7
1          Carol Burnett Show, The             7
2                            Alice             7
3                       La La Land             6
4                 Sex and The City             5
5  One Flew Over The Cuckoo's Nest             5
6                 Midnight Express             5
7               Lawrence Of Arabia             5
8                           Cheers             5
9                          30 Rock             5

In [19]:
sqldf('''
SELECT nominee, count(*) as no_of_prizes 
FROM golden_globe_awards
WHERE nominee IS NOT NULL AND win IS TRUE
GROUP BY film
ORDER BY 2 DESC
LIMIT 10
''')

                  nominee  no_of_prizes
0  The Song Of Bernadette           425
1        McLean Stevenson             7
2           Carol Burnett             7
3             Linda Lavin             7
4              Emma Stone             6
5    Sarah Jessica Parker             5
6         Louise Fletcher             5
7               John Hurt             5
8             Omar Sharif             5
9            Shelley Long             5

In [24]:
sqldf('''
WITH last_year_prizes as (SELECT * FROM golden_globe_awards WHERE year_award = 2019)
SELECT film, year_film, count(*) as no_of_prizes 
FROM last_year_prizes
WHERE film IS NOT NULL AND win IS TRUE
GROUP BY film, year_film
ORDER BY 2 DESC
LIMIT 10
''')

                                                film  year_film  no_of_prizes
0  Assassination of Gianni Versace: American Crim...       2018             1
1                                          Bodyguard       2018             1
2                                  Bohemian Rhapsody       2018             1
3                                Escape at Dannemora       2018             1
4                                     Favourite, The       2018             1
5                                          First Man       2018             1
6                                         Green Book       2018             2
7                         If Beale Street Could Talk       2018             1
8                                        Killing Eve       2018             1
9                               Kominsky Method, The       2018             1